tests/load/stress.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      rampTo: 50
  plugins:
    expect: {}
scenarios:
  - name: Mixed API stress
    flow:
      - get:
          url: "/api/openapi.json"
          expect:
            - statusCode: 200
      - post:
          url: "/public/score"
          headers:
            Content-Type: "application/json"
            x-api-key: "tk_tlm_DEMO_SANDBOX"
          json:
            features: { viewCount: 10000 }
          expect:
            - statusCode: 200